<!-- add-pr-comment:newrelic_plan -->

# staging/newrelic Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # newrelic_alert_policy.terraform_notify_policy[0] will be created
  + resource "newrelic_alert_policy" "terraform_notify_policy" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_POLICY"
      + name                = "Notify Policy - staging"
    }
  # newrelic_alert_policy.terraform_notify_policy_by_condition[0] will be created
  + resource "newrelic_alert_policy" "terraform_notify_policy_by_condition" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_CONDITION"
      + name                = "Notify Policy - staging by condition"
    }
  # newrelic_notification_channel.terraform_notify_channel[0] will be created
  + resource "newrelic_notification_channel" "terraform_notify_channel" {
      + account_id     = (known after apply)
      + active         = true
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "Notify Slack Channel - staging"
      + product        = "IINT"
      + status         = (known after apply)
      + type           = "SLACK_LEGACY"
      + property {
          + key           = "payload"
          + label         = "Payload Template"
          + value         = jsonencode({})
            # (1 unchanged attribute hidden)
        }
    }
  # newrelic_notification_destination.terraform_notify_destination[0] will be created
  + resource "newrelic_notification_destination" "terraform_notify_destination" {
      + account_id = (sensitive value)
      + active     = true
      + guid       = (known after apply)
      + id         = (known after apply)
      + last_sent  = (known after apply)
      + name       = "Notify Slack Destination - staging"
      + status     = (known after apply)
      + type       = "SLACK_LEGACY"
      + property {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }
  # newrelic_nrql_alert_condition.admin_error_percentage[0] will be created
  + resource "newrelic_nrql_alert_condition" "admin_error_percentage" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[Admin] Error percentage"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 1
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (511399580) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 0.5
          + threshold_duration              = 600
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.admin_response_time[0] will be created
  + resource "newrelic_nrql_alert_condition" "admin_response_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[Admin] Response time"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 0.5
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (511399580) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 0.2
          + threshold_duration              = 600
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.external_services_callbacks_over_5_seconds_duration[0] will be created
  + resource "newrelic_nrql_alert_condition" "external_services_callbacks_over_5_seconds_duration" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + description                  = (sensitive value)
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "[External Services / Callbacks] Over 5 seconds duration"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 3600
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 10
          + threshold_duration              = 60
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT max(duration) FROM Span WHERE service.name like 'notification-celery-staging' AND http.url IS NOT NULL AND http.url not like '%amazonaws.com%' AND http.url not like '%notification.canada.ca%' AND name like 'External%' facet http.url"
        }
    }
  # newrelic_nrql_alert_condition.internal_services_awsnotify_over_5_seconds_duration[0] will be created
  + resource "newrelic_nrql_alert_condition" "internal_services_awsnotify_over_5_seconds_duration" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + description                  = (sensitive value)
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "[Internal Services / AWS+Notify] Over 5 seconds duration"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 10
          + threshold_duration              = 60
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT max(duration) FROM Span WHERE service.name like 'notification-celery-staging' AND http.url IS NOT NULL AND (http.url like '%amazonaws.com%' OR http.url like '%notification.canada.ca%') AND name like 'External%' facet http.url"
        }
    }
  # newrelic_nrql_alert_condition.k8s_api_error_percentage[0] will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_error_percentage" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Error percentage"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 2
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 1
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.k8s_api_response_time[0] will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_response_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Response time"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 0.1
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 0.05
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.k8s_api_transaction_database_time[0] will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_transaction_database_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "lower_only"
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Transaction database time"
      + policy_id                    = (known after apply)
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 2.81838
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'Datastore/all') OR 0 FROM Metric WHERE appId IN (511399611) AND metricTimesliceName IN ('Datastore/all', 'Agent/MetricsReported/count') FACET appId"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 2.81838
          + threshold_duration              = 180
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_error_count_anomaly_fuzzy_attack[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_error_count_anomaly_fuzzy_attack" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "300"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "upper_and_lower"
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "[Lambda API] Error count anomaly (Fuzzy attack)"
      + policy_id                    = (known after apply)
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 8
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5') AND `error.class` IN ('app.authentication.auth:AuthError', 'app.v2.errors:BadRequestError', 'werkzeug.exceptions:MethodNotAllowed')"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 5
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_error_percentage_api_user_errors[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_api_user_errors" {
      + account_id                     = (sensitive value)
      + aggregation_delay              = "300"
      + aggregation_method             = "event_flow"
      + aggregation_window             = 60
      + close_violations_on_expiration = true
      + enabled                        = false
      + entity_guid                    = (known after apply)
      + expiration_duration            = 300
      + id                             = (known after apply)
      + name                           = "[Lambda API] Error percentage (API User Errors)"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 2
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT percentage(count(*), WHERE `error.class` IS NOT null)*100 / percentage(count(*), WHERE duration IS NOT null) as 'Error rate (%); filtered' FROM AwsLambdaInvocation, AwsLambdaInvocationError WHERE `entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5' AND `error.class` IN ('jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound')"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 1
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_error_percentage_fuzzy_attack[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_fuzzy_attack" {
      + account_id                     = (sensitive value)
      + aggregation_delay              = "300"
      + aggregation_method             = "event_flow"
      + aggregation_window             = 60
      + close_violations_on_expiration = true
      + enabled                        = false
      + entity_guid                    = (known after apply)
      + expiration_duration            = 300
      + id                             = (known after apply)
      + name                           = "[Lambda API] Error percentage (Fuzzy attack)"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 86400
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT percentage(count(*), WHERE `error.class` IS NOT null)*100 / percentage(count(*), WHERE duration IS NOT null) as 'Error rate (%); filtered' FROM AwsLambdaInvocation, AwsLambdaInvocationError WHERE `entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5' AND `error.class` IN ('app.authentication.auth:AuthError', 'app.v2.errors:BadRequestError', 'werkzeug.exceptions:MethodNotAllowed')"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 15
          + threshold_duration              = 600
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_error_percentage_fuzzy_attack_anomaly_detection[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_fuzzy_attack_anomaly_detection" {
      + account_id                     = (sensitive value)
      + aggregation_delay              = "300"
      + aggregation_method             = "event_flow"
      + aggregation_window             = 60
      + baseline_direction             = "upper_only"
      + close_violations_on_expiration = true
      + description                    = <<-EOT
            Unusual fuzzy attack is detected.
        EOT
      + enabled                        = false
      + entity_guid                    = (known after apply)
      + expiration_duration            = 600
      + id                             = (known after apply)
      + name                           = "[Lambda API] Error percentage (Fuzzy attack) (Anomaly Detection)"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "baseline"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 5
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT percentage(count(*), WHERE `error.class` IS NOT null)*100 / percentage(count(*), WHERE duration IS NOT null) as 'Error rate (%); filtered' FROM AwsLambdaInvocation, AwsLambdaInvocationError WHERE `entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5' AND `error.class` IN ('app.authentication.auth:AuthError', 'app.v2.errors:BadRequestError', 'werkzeug.exceptions:MethodNotAllowed')"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_error_percentage_unexpected_errors[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_error_percentage_unexpected_errors" {
      + account_id                     = (sensitive value)
      + aggregation_delay              = "300"
      + aggregation_method             = "event_flow"
      + aggregation_window             = 60
      + close_violations_on_expiration = true
      + enabled                        = false
      + entity_guid                    = (known after apply)
      + expiration_duration            = 300
      + id                             = (known after apply)
      + name                           = "[Lambda API] Error percentage (Unexpected Errors)"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 2
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT percentage(count(*), WHERE `error.class` IS NOT null)*100 / percentage(count(*), WHERE duration IS NOT null) as 'Error rate (%); filtered' FROM AwsLambdaInvocation, AwsLambdaInvocationError WHERE `entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5' AND `error.class` NOT IN ('app.authentication.auth:AuthError', 'app.v2.errors:BadRequestError','jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound', 'werkzeug.exceptions:MethodNotAllowed') and error.message NOT LIKE '{\\'result\\': \\'error\\', \\'message\\': {\\'password\\': [\\'Incorrect password\\']}}'"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 1
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_errors_count_anomaly_api_user_errors[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_errors_count_anomaly_api_user_errors" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "300"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "upper_and_lower"
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "[Lambda API] Errors count anomaly (API User Errors)"
      + policy_id                    = (known after apply)
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 12
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5') AND `error.class` IN ('jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound')"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 6
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_nrql_alert_condition.lambda_api_errors_count_anomaly_unexpected_errors[0] will be created
  + resource "newrelic_nrql_alert_condition" "lambda_api_errors_count_anomaly_unexpected_errors" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "300"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "upper_and_lower"
      + enabled                      = false
      + entity_guid                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "[Lambda API] Errors count anomaly (Unexpected Errors)"
      + policy_id                    = (known after apply)
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 86400
      + critical {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 6
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT count(*) FROM AwsLambdaInvocationError WHERE (`entityGuid`='MjY5MTk3NHxJTkZSQXxOQXw4OTUyNzY1NzE2MDc3MTExMjI5') and error.class NOT IN ('app.v2.errors:BadRequestError','jsonschema.exceptions:ValidationError', 'sqlalchemy.exc:NoResultFound', 'app.authentication.auth:AuthError', 'werkzeug.exceptions:MethodNotAllowed') and error.message NOT LIKE '{\\'result\\': \\'error\\', \\'message\\': {\\'password\\': [\\'Incorrect password\\']}}'"
        }
      + warning {
          + disable_health_status_reporting = false
          + operator                        = "above"
          + threshold                       = 3
          + threshold_duration              = 300
          + threshold_occurrences           = "all"
        }
    }
  # newrelic_workflow.terraform_notify_workflow[0] will be created
  + resource "newrelic_workflow" "terraform_notify_workflow" {
      + account_id            = (sensitive value)
      + destinations_enabled  = true
      + enabled               = true
      + enrichments_enabled   = true
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + last_run              = (known after apply)
      + muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
      + name                  = "Notify Workflow - staging"
      + workflow_id           = (known after apply)
      + destination {
          + channel_id              = (known after apply)
          + name                    = (known after apply)
          + notification_triggers   = [
              + "ACKNOWLEDGED",
              + "ACTIVATED",
              + "CLOSED",
            ]
          + type                    = (known after apply)
          + update_original_message = true
        }
      + issues_filter {
          + filter_id = (known after apply)
          + name      = "workflow-filter"
          + type      = "FILTER"
          + predicate {
              + attribute = "labels.policyIds"
              + operator  = "EXACTLY_MATCHES"
              + values    = (known after apply)
            }
          + predicate {
              + attribute = "priority"
              + operator  = "EQUAL"
              + values    = [
                  + "CRITICAL",
                ]
            }
        }
    }
Plan: 19 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```